[{
  "_id": 50,
  "artist": "Black Thought ft. Rapsody",
  "description": "Don't overlook the undeniable skill and old-head rap thrills of Black Thought. The second most famous member of the Roots (behind Questlove) is one of the purest MCs in the game. On \"Dostoyevsky,\" he raps over a pristine 9th Wonder beat, name-checking someone who, in his words. \"spoke to the social and political, and spiritual struggles of his time\" in the same way he does. \"This is crime and punishment, I'm the judge and the jury / Listen, Dostoyevsky.\" Rapsody delivers a fire verse referencing legendary beat maker J. Dilla, The Weeknd, and then comparing herself to sharp-shooting Trae Young, elevating \"Dostoyevsky\" from great to excellent. Then Black Thought comes back in to flex before it all wraps up -- \"But love it or hate it, I will not be subjugated / When they screamin' 'You the greatest that did it,' what's underrated?\"",
  "end": 185,
  "genres": ["ALL", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545781246/dbrad2018/best_songs_2018_blackthought_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=8pfh8s8KVkM\" target=\"_blank\">Black Thought ft. Rapsody, \"Dostoyevsky\"</a>",
  "start": 150,
  "title": "Dostoyevsky",
  "videoUrl": "https://www.youtube.com/watch?v=8pfh8s8KVkM",
  "youtube": true
}, {
  "_id": 49,
  "artist": "Nine Inch Nails",
  "description": "What '90s alternative rock bands with a history of massive radio play are still making solid, vital music in 2018? Not many. Trent Reznor and Nine Inch Nails are an exception, however. \"Over and Out\" simmers and seethes over a hypnotic bass groove, with swirling sound effects (including a well-placed marimba), crescendoing into a climax of noise before closing fading into a twinkly night sky.",
  "end": 250,
  "genres": ["ALL", "ROCK", "ELECTRONIC", "Alternative"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634905/dbrad2018/best_songs_2018_nineinchnails_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=XBalEvn-sXU\" target=\"_blank\">Nine Inch Nails, \"Over and Out\"</a>",
  "start": 210,
  "title": "Over and Out",
  "videoUrl": "https://www.youtube.com/watch?v=XBalEvn-sXU",
  "youtube": true
}, {
  "_id": 48,
  "artist": "Saba ft. Chance the Rapper",
  "description": "Saba carries the torch of \"conscious rap\" at a time when that style of free-flowing, soulful, underground rap has received less critical attention than it once did, when Common, Mos Def, and Talib Kweli were the standard bearers. On \"Logout,\" Saba and fellow Chicagoan Chance the Rapper tackle our collective obsession with the instantaneous, hollow validation of social media over a nonchalant, jazzy beat: \"If you press logout, you get forgotten / What's a post but a reminder just how boring our lives are? / Look at how much fun I'm havin' / Ain't no beauty in the absence of broadcastin' to your followers.\"",
  "end": 38,
  "genres": ["ALL", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634631/dbrad2018/best_songs_2018_saba-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=3wU3FM7R2Gc\" target=\"_blank\">Saba, \"LOGOUT (feat. Chance the Rapper)\"</a>",
  "start": 5,
  "title": "LOGOUT",
  "videoUrl": "https://www.youtube.com/watch?v=3wU3FM7R2Gc",
  "youtube": true
}, {
  "_id": 47,
  "artist": "Ariana Grande",
  "description": "Ariana Grande took her place on top of the pop world in 2018. Her stardom grew exponentially as she navigated the insane highs and lows of the last couple years. After the devastating bombing of her Manchester show last year, as well as her very public relationships and breakups with SNL's Pete Davidson and rapper Mac Miller (who committed suicide this year), she has responded throughout with tremendous grace. \"no tears left to cry\" is a fitting soundtrack to those experiences. The song boasts a tranquility and energy that can come after accepting how terrible things have been and looking forward to the turnaround: \"Ain't got no tears in my body, I ran out, but boy, I like it.\" Somehow, she's still out here vibin'.",
  "end": 120,
  "genres": ["ALL", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634631/dbrad2018/best_songs_2018_arianagrande_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=ffxKSjUwKdU\" target=\"_blank\">Ariana Grande, \"no tears left to cry\"</a>",
  "start": 81,
  "title": "no tears left to cry",
  "videoUrl": "https://www.youtube.com/watch?v=ffxKSjUwKdU",
  "youtube": true
}, {
  "_id": 46,
  "artist": "Iceage",
  "description": "Iceage, from Copenhagen, Denmark, started out primarily as a hardcore band, but have since migrated more toward post-punk territory (and I think they're better for it). \"Hurrah\" is classic-sounding but modernly-steeped heavy rock and roll, fit for blasting from a mountaintop. It gives off flashes of the Rolling Stones, the Stooges, and Crazy Horse, but it mostly reminds me of their hard rock contemporaries, the Men. It's a ferocious barrage of a song with an antiwar message and an ominous presence.",
  "end": 76,
  "genres": ["ALL", "ROCK", "INDIE", "HARD ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634633/dbrad2018/best_songs_2018_iceage_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://open.spotify.com/track/0KXPx2e7up8Fl7wWjKWOJj?si=Z4ee2TMqQs-1omIb0TuWpQ\" target=\"_blank\">Iceage, \"Hurrah\"</a>",
  "start": 39,
  "title": "Hurrah",
  "videoUrl": "https://www.youtube.com/watch?v=QSiTpentfhk",
  "youtube": true
}, {
  "_id": 45,
  "artist": "MGMT",
  "description": "The boys of MGMT had a hard time accepting the widespread popularity of the sleeper hits from their debut album (\"Time to Pretend,\" \"Kids,\" and \"Electric Feel\"). Since then, they've tried to subvert hooks in favor of fully psychedelic textures. They're not looking to provide more fodder for your frat party soundtrack. On this year's <i>Little Dark Age</i> though, they've settled on a happy medium, peeling back their impenetrable layers to let some hooks shine through. The album's synth-laden title track is dark and spooky, but in a theatrical, convivial way. MGMT have always had fun, but now they're letting us in on the fun again.",
  "end": 268,
  "genres": ["ALL", "INDIE"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545636910/dbrad2018/best_songs_2018_mgmt_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=rtL5oMyBHPs\" target=\"_blank\">MGMT, \"Little Dark Age\"</a>",
  "start": 224,
  "title": "Little Dark Age",
  "videoUrl": "https://www.youtube.com/watch?v=rtL5oMyBHPs",
  "youtube": true
}, {
  "_id": 44,
  "artist": "Maggie Rogers",
  "description": "I knew from the moment it was announced that the partnership of rising indie pop star Maggie Rogers and former Vampire Weekend member and currently prolific producer Rostam Batmanglij was going to work out beautifully. \"Fallingwater\" is a lush, technicolor dream, with a pulsating backbeat and moments of glimmering transcendence.",
  "end": 140,
  "genres": ["ALL", "INDIE", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634690/dbrad2018/best_songs_2018_maggierogers_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=bR1d8l92Q8Q\" target=\"_blank\">Maggie Rogers, \"Fallingwater\"</a>",
  "start": 100,
  "title": "Fallingwater",
  "videoUrl": "https://www.youtube.com/watch?v=bR1d8l92Q8Q",
  "youtube": true
}, {
  "_id": 43,
  "artist": "Dirty Projectors",
  "description": "Dave Longstreth and his Dirty Projectors are part of a cabal of indie bands that have largely moved past their cultural and critical heyday. Dirty Projectors just don't command attention like they did at the beginning of this decade. While I welcome the new bands and micro-genres that are blooming in their stead, I also miss the time when everyone was celebrating bands like Dirty Projectors. \"That's a Lifestyle\" is as good as anything on <i>Bitte Orca</i> -- it's equal parts experimental and catchy (not many have Longstreth's skill at making songs that fit both of those adjectives). It revolves around a bright and clear acoustic guitar line, and includes the band's signature harmonic accents.",
  "end": 71,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634634/dbrad2018/best_songs_2018_dirtyprojectors_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=bKJBSjadBRw\" target=\"_blank\">Dirty Projectors, \"That's A Lifestyle\"</a>",
  "start": 32,
  "title": "That's A Lifestyle",
  "videoUrl": "https://www.youtube.com/watch?v=bKJBSjadBRw",
  "youtube": true
}, {
  "_id": 42,
  "artist": "Janelle Mon&aacute;e",
  "description": "<p>Does Janelle Mon&aacute;e have any haters? It seems impossible. The esteemed musician, actress, and fashion icon has both wide appeal and an ability to inspire passionate fans. On her latest album, <i>Dirty Computer</i>, Mon&aacute;e opens up to the audience with newfound intimacy, putting her \"human\" side front and center, superseding the \"android\" persona that defined her earlier work. \"Django Jane\" gives us Monae the rapper, and it turns out, she's good at rapping too. Her charisma can't be contained.</p><p>My favorite moment comes about midway through (after \"I cut 'em off, I cut 'em off, I cut 'em off like Van Gogh\") when she gives a smirking laugh: \"Hah. Cue the violins and violas.\" It's reminiscent of Barack Obama, when he'd deploy a short, timely laugh to punctuate a certain pointed comment or argument. The laugh oozes confidence, which Mon&aacute;e possesses in droves. She is a baller, through and through.</p>",
  "end": 119,
  "genres": ["ALL", "R&amp;B", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634907/dbrad2018/best_songs_2018_janellemonae_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=mTjQq5rMlEY\" target=\"_blank\">Janelle Mon&aacute;e, \"Django Jane\"</a>",
  "start": 76,
  "title": "Django Jane",
  "videoUrl": "https://www.youtube.com/watch?v=mTjQq5rMlEY",
  "youtube": true
}, {
  "_id": 41,
  "artist": "Amen Dunes",
  "description": "Damon McMahon has helmed Amen Dunes for 12 years, largely operating under the radar, but had a creative breakthrough on this year's <i>Freedom</i>. The whole album is superb, but my favorite track is the chugging \"Miki Dora,\" named for an infamous and idiosyncratic surfer from the 1960s. The song settles into a beguiling groove, as McMahon <a href=\"https://www.instagram.com/p/BeExavxFXLQ/\" target=\"_blank\">reflects on the</a> \"manifestations of mythical heroic maleness and its illusions.\"",
  "end": 140,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634693/dbrad2018/best_songs_2018_amendunes_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=RONXqXaF8oI\" target=\"_blank\">Amen Dunes, \"Miki Dora\"</a>",
  "start": 102,
  "title": "Miki Dora",
  "videoUrl": "https://www.youtube.com/watch?v=RONXqXaF8oI",
  "youtube": true
}, {
  "_id": 40,
  "artist": "Tomberlin",
  "description": "\"Any Other Way\" is about realizing you're out of place in your own existence. It's a devastatingly beautiful, spare song -- just four acoustic guitar chords and a rotating melody of Sarah Beth Tomberlin's double-tracked vocals, with expertly placed piano accents throughout. Tomberlin explores the complicated feelings of what to do when you're questioning the very foundation of your love for someone: \"I'm tired of feeling like you only stay out of guilt and out of shame, but did we know any other way?\"",
  "end": 131,
  "genres": ["ALL", "INDIE", "FOLK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634635/dbrad2018/best_songs_2018_tomberlin_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=vquVuj0DWZk\" target=\"_blank\">Tomberlin, \"Any Other Way\"</a>",
  "start": 93,
  "title": "Any Other Way",
  "videoUrl": "https://www.youtube.com/watch?v=vquVuj0DWZk",
  "youtube": true
}, {
  "_id": 39,
  "artist": "Cardi B ft. Bad Bunny & J Balvin",
  "description": "\"I Like It\" was the biggest challenger to Drake's \"Nice for What\" for the title of \"song of the summer.\" Even though it was inescapable for a few months, I never tired of hearing \"I said I like it like that!\" The music deftly fuses the piano and trumpets of salsa with the boom-bap bass and beats of hip-hop -- Wikipedia calls the song's genre \"latin trap,\" which is a perfect summation. The track transports you to a hot, sticky summer day in Cardi B's Bronx stomping grounds, complementing her unique style of bravado. Spanish-language (and Spanglish) hits are having a moment in the U.S., and I like it like that.",
  "end": 94,
  "genres": ["ALL", "LATIN", "RAP", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634637/dbrad2018/best_songs_2018_cardib_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=xTlNMmZKwpA\" target=\"_blank\">Cardi B ft. Bad Bunny & J Balvin, \"I Like It\"</a>",
  "start": 56,
  "title": "I Like It",
  "videoUrl": "https://www.youtube.com/watch?v=xTlNMmZKwpA",
  "youtube": true
}, {
  "_id": 38,
  "artist": "No Age",
  "description": "I can picture my sister listening to this and wondering why in the world I would like it. No Age make noisy, cluttered rock buried in fuzz, often featuring vocals that barely qualify as melody. Based on said sister's opinion of Japandroids, I can surmise what her reaction to this would be. \"Send Me\" is the closest No Age comes to making a sweet, tender ballad. The ringing guitars roil back and forth while drummer and vocalist Dean Allen Spunt part-sings/part-speaks, \"Send me! Where should I go?\" The often off-tune singing somehow just <i>works</i> with those shimmering guitars. What one might find grating, another might find sublime.",
  "end": 194,
  "genres": ["ALL", "INDIE", "ROCK", "HARD ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634687/dbrad2018/best_songs_2018_noage_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=B7WiAVLqJOc\" target=\"_blank\">No Age, \"Send Me\"</a>",
  "start": 151,
  "title": "Send Me",
  "videoUrl": "https://www.youtube.com/watch?v=B7WiAVLqJOc",
  "youtube": true
}, {
  "_id": 37,
  "artist": "Snail Mail",
  "description": "Lindsey Jordan is only 19 and already an expert in the history of alternative rock -- at least, according to the sound of her superb musical output. \"Pristine\" sounds like a Sonic Youth song, but with a bit more pop, in addition to its '90s-alternative-style vocals. Jordan laments the loss of a close relationship: \"And if you do find someone better, I'll still see you in everything, tomorrow and all the time.\" The lyrical sentiment walks hand-in-hand with the music: wistful and intimately familiar.",
  "end": 96,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634903/dbrad2018/best_songs_2018_snailmail_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=s7tnTucP1UM\" target=\"_blank\">Snail Mail, \"Pristine\"</a>",
  "start": 60,
  "title": "Pristine",
  "videoUrl": "https://www.youtube.com/watch?v=s7tnTucP1UM",
  "youtube": true
}, {
  "_id": 36,
  "artist": "Lizzo",
  "description": "\"Boys\" needs to become a party staple. I would be shocked if anyone disliked this track from Minneapolis rapper Lizzo. Everything about \"Boys\" oozes confidence -- the production is steeped in funk and hip-hop through the ages, from James Brown to Prince to Pharrell. And I don't need to explain the tenacious self-assurance in Lizzo's voice, as she pays tribute to the boys: \"I like big boys, itty bitty boys, Mississippi boys, inner city boys...\"",
  "end": 74,
  "genres": ["ALL", "POP", "RAP", "FUNK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545784310/dbrad2018/best_songs_2018_lizzo_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=XplzAs0El2Y\" target=\"_blank\">Lizzo, \"Boys\"</a>",
  "start": 26,
  "title": "Boys",
  "videoUrl": "https://www.youtube.com/watch?v=XplzAs0El2Y",
  "youtube": true
}, {
  "_id": 35,
  "artist": "Charli XCX ft. Troye Sivan",
  "description": "<p>Anyone remember \"1985\" by Bowling for Soup? The hit that celebrated Bruce Springsteen and Madonna (way before Nirvana) came out in 2004, 19 years after its subject year. Well, now it has a spiritual sequel -- and the sequel is better. \"1999\" was also released exactly 19 years after the focus of its nostalgia -- I don't know if that was intentional, but I applaud it.</p><p>\"1999\" doesn't have near as many specific callbacks as \"1985\" did (I think Britney Spears, Jonathan Taylor Thomas, Nike Airs, <i>All That</i>, and CDs are the only references particular to 1999, if I didn't miss any). But the song itself is way catchier than \"1985.\" Sorry, Bowling for Soup fans. Anything Charli XCX and Troye Sivan touch turns to gold, so it's to be expected. Also, be sure to watch the video for endless late-'90s touchpoints, including Titanic, the Matrix, and more.</p>",
  "end": 96,
  "genres": ["ALL", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634687/dbrad2018/best_songs_2018_charlixcx_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=6-v1b9waHWY\" target=\"_blank\">Charli XCX ft. Troye Sivan, \"1999\"</a>",
  "start": 59,
  "title": "1999",
  "videoUrl": "https://www.youtube.com/watch?v=6-v1b9waHWY",
  "youtube": true
}, {
  "_id": 34,
  "artist": "Parquet Courts",
  "description": "<p>When you're putting together a dance playlist, what are usually the most prominent genres? Pop, hip-hop, Motown, funk, electronic? All worthy choices, but rock often gets short shrift. Don't ever think you can't dance to rock and roll -- Chuck Berry and Elvis Presley would roll over in their graves if you thought otherwise. Having said all this, I did <i>not</i> expect rock this danceable to come from an art-punk band like Parquet Courts.</p><p>The Brooklyn band teamed up with Danger Mouse (who generates a lot of <a href=\"https://dbradmusic.com/2015/03/19/the-major-rise-and-minor-fall-of-danger-mouse/\" target=\"_blank\">mixed feelings within me</a>) and not only made one of the best albums of the year, but maybe the best dance of song of the year. On \"Wide Awake,\" frenetic percussion, a busy bass line, jagged guitar pokes, and vocals that tilt more toward chanting than actual singing, all combine to form some pitch-perfect dance punk. I hope James Murphy likes it.</p>",
  "end": 55,
  "genres": ["ALL", "INDIE", "ROCK", "DANCE"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634689/dbrad2018/best_songs_2018_parquetcourts_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=eZXS8Jpkiac\" target=\"_blank\">Parquet Courts, \"Wide Awake\"</a>",
  "start": 15,
  "title": "Wide Awake",
  "videoUrl": "https://www.youtube.com/watch?v=eZXS8Jpkiac",
  "youtube": true
}, {
  "_id": 33,
  "artist": "Soccer Mommy",
  "description": "<p>The dream of the '90s is alive with Soccer Mommy. Sophie Allison was just 20 years old when \"Cool\" was released, a fact that will always be mind-blowing to me considering how advanced, nuanced, and seasoned this rock music is. That discordant guitar opening is perfect to me.</p><p>Allison says \"Cool\" is a naive portrait of who she wants to be: \"It's fun and upbeat because it's like a hopeful moment where I'm thinking about how I'm going to be moving forward in my life. However, it's idealizing things that won't necessarily make me happy.\" Also, I sound like a broken record belaboring this point, but if you're turned off by the name \"Soccer Mommy,\" please place that aside and push through. Allison's music is just too good to miss. Ignore at your own peril.</p>",
  "end": 139,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634963/dbrad2018/best_songs_2018_soccermommy1_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=7Phsup-LrII\" target=\"_blank\">Soccer Mommy, \"Cool\"</a>",
  "start": 97,
  "title": "Cool",
  "videoUrl": "https://www.youtube.com/watch?v=7Phsup-LrII",
  "youtube": true
}, {
  "_id": 32,
  "artist": "boygenius",
  "description": "The best story in indie-dom was the surprise creation of supergroup boygenius, comprising three of the most exciting women in music right now: Julien Baker, Phoebe Bridgers, and Lucy Dacus. They each have an impeccable oeuvre of confessional folk-ish rock to their names already, but their collaborative EP <i>boygenius</i> is some of their best work. Think of what they bring to the table already, but now add three-part harmonies. \"Souvenir\" is one of the more stripped-back songs on the EP, and also one of the most egalitarian -- all three members have a heart-stopping solo turn (of varying length), but the harmony-laden \"oohs\" functioning as the chorus are still the best part.",
  "end": 163,
  "genres": ["ALL", "INDIE", "FOLK", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634689/dbrad2018/best_songs_2018_boygenius_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=OS48Lp34Zic\" target=\"_blank\">boygenius, \"Souvenir\"</a>",
  "start": 115,
  "title": "Souvenir",
  "videoUrl": "https://www.youtube.com/watch?v=OS48Lp34Zic",
  "youtube": true
}, {
  "_id": 31,
  "artist": "ZHU ft. Tame Impala",
  "description": "Remember when Tame Impala was a little band from Australia, just out there putting their spin on Led Zeppelin and Pink Floyd? Now they're headlining festivals, and the band's mastermind Kevin Parker is producing for Lady Gaga and Travis Scott. One of Parker's best collaborations to date is this year's \"My Life\" with electronic/house producer Zhu. Zhu brings a slinky, late-night-ready, synth-and-bass-heavy beat that perfectly complements Parker's psychedelic vocal lines. Don't miss playing this at your next dance party.",
  "end": 177,
  "genres": ["ALL", "POP", "ELECTRONIC"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545782394/dbrad2018/best_songs_2018_zhu_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=cNizeRa8DZ4\" target=\"_blank\">ZHU ft. Tame Impala, \"My Life\"</a>",
  "start": 128,
  "title": "My Life",
  "videoUrl": "https://www.youtube.com/watch?v=cNizeRa8DZ4",
  "youtube": true
}, {
  "_id": 30,
  "artist": "Robyn",
  "description": "<p>2018 saw the long-awaited return of Robyn, who last ignited the music world with \"Dancing On My Own\" and \"Call Your Girlfriend\" in 2010. It turns out her new album, <i>Honey</i>, is, on the whole, much more understated than many of us expected. The closest thing to a club banger is \"Missing U,\" but even that has a certain minimalism to it.</p><p>The minimalism doesn't make her new sound any less exhilarating though. Neither does it portend a change in mood -- Robyn is still singing about loneliness. \"Baby, it's so real to me now it's over. The space where you used to be, your head on my shoulder. All of the plans we made that never happened. Now your scent on my pillow's faded -- at least you left me with something.\" No one evokes tear-stained dance floors better than Robyn.</p>",
  "end": 107,
  "genres": ["ALL", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545782393/dbrad2018/best_songs_2018_robyn_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=8o5BHH9U2Mg\" target=\"_blank\">Robyn, \"Missing U\"</a>",
  "start": 59,
  "title": "Missing U",
  "videoUrl": "https://www.youtube.com/watch?v=8o5BHH9U2Mg",
  "youtube": true
}, {
  "_id": 29,
  "artist": "Caroline Rose",
  "description": "\"Jeannie Becomes a Mom\" was inspired by a friend of Caroline Rose who accidentally got pregnant, but Rose expanded on that to address anxieties of her own as well. There's nothing like having a baby to reexamine your life with added perspective. There can be tremendous joy in it, but also it can result in the stark realization Rose outlines in the chorus: \"The world don't stop, time is really going to pass you by. Now you're in real liiiiiiife.\" The song is a banger too -- the syncopated organ chords and crisp drums add up to a satisfyingly, lively beat.",
  "end": 121,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634692/dbrad2018/best_songs_2018_carolinerose_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=1bx8QdYj0Pg\" target=\"_blank\">Caroline Rose, \"Jeannie Becomes a Mom\"</a>",
  "start": 76,
  "title": "Jeannie Becomes a Mom",
  "videoUrl": "https://www.youtube.com/watch?v=1bx8QdYj0Pg",
  "youtube": true
}, {
  "_id": 28,
  "artist": "Kacey Musgraves",
  "description": "Kacey Musgraves's \"High Horse\" wins the award for most relatable song. Exhibit A: \"'Cause everyone knows someone who kills the buzz every time they open up their mouth.\" Exhibit B: \"Yeah, everyone knows someone who knows someone who thinks they're cooler than everybody else.\" Musgraves has a knack for one-liners that delight (or, depending on the listener, sting) in a visceral way, like her winking delivery of \"Oh, I bet you think you're John Wayne\" and \"You're classic in the wrong way,\" both in the first verse alone. And like the subject matter, the music also has widespread appeal -- she decided to cross over into pop territory on \"High Horse,\" giving the song a disco sheen and a top-40 eye.",
  "end": 91,
  "genres": ["ALL", "COUNTRY", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545845922/dbrad2018/best_songs_2018_kaceymusgraves2_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=fbNDJRwXKGc\" target=\"_blank\">Kacey Musgraves, \"High Horse\"</a>",
  "start": 30,
  "title": "High Horse",
  "videoUrl": "https://www.youtube.com/watch?v=fbNDJRwXKGc",
  "youtube": true
}, {
  "_id": 27,
  "artist": "Bad Bunny ft. Drake",
  "description": "<p>Puerto Rican reggaeton artist Bad Bunny has had a big year in the U.S., highlighted by his feature on Cardi B's smash hit \"I Like It.\" But his best entry into the musical tapestry of 2018 was the Drake-featuring \"MIA.\" One of Drake's biggest strengths is his ability to inhabit different musical diasporas and sound like a natural. We're used to him both rapping and singing with aplomb, but he's been known to dabble in different micro-genres and somehow not come off like a poser. And apparently, he can sing in Spanish. My mind is honestly blown by how good his Spanish is here, singing \"Dile que tu eres m&iacute;a, m&iacute;a, tu sabes que eres m&iacute;a, m&iacute;a\" with an excellent accent.</p><p>\"MIA\" is vibrant and fresh, and I can't place my finger on exactly why. It's not doing anything new -- we've heard similarly styled Latin pop songs crossover into American consciousness, but the production sounds extra crisp here. This could have easily been the song of summer if it had dropped before October.</p>",
  "end": 65,
  "genres": ["ALL", "LATIN", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634895/dbrad2018/best_songs_2018_badbunny_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=OSUxrSe5GbI\" target=\"_blank\">Bad Bunny ft. Drake, \"MIA\"</a>",
  "start": 10,
  "title": "MIA",
  "videoUrl": "https://www.youtube.com/watch?v=OSUxrSe5GbI",
  "youtube": true
}, {
  "_id": 26,
  "artist": "MorMor",
  "description": "Just when you think you have a hold of what genre \"Heaven's Only Wishful\" is, it switches up on you. The verses sound like alternative rock, but the choruses sound like '80s pop. My favorite part of the song comes in the last minute, when everything is stripped away except for a simple drumbeat, unadorned guitar, and MorMor (a.k.a. Seth Nyquist) singing \"Some say you're the reason I feel this way,\" before dialing up with the addition of bass and a soaring electric guitar, as MorMor goes up an octave to an almost shriek-sing. Despite the familiar elements contained here, I can confidently say I've never heard a song quite like \"Heaven's Only Wishful.\"",
  "end": 287,
  "genres": ["ALL", "INDIE", "POP", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545783450/dbrad2018/best_songs_2018_mormor_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=9PvIIn6cc1M\" target=\"_blank\">MorMor, \"Heaven's Only Wishful\"</a>",
  "start": 210,
  "title": "Heaven's Only Wishful",
  "videoUrl": "https://www.youtube.com/watch?v=9PvIIn6cc1M",
  "youtube": true
}, {
  "_id": 25,
  "artist": "Amber Mark",
  "description": "No one sounds more vibrant and alive than Amber Mark right now. Without dropping an album, Mark has released an EP and various singles, all of which have been superb. \"Love is Stronger Than Pride\" is a Sade cover infused with luscious, all-encompassing production that builds and breathes in all the right places. Oh and Mark's voice is gorgeous.",
  "end": 96,
  "genres": ["ALL", "R&amp;B"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545781241/dbrad2018/best_songs_2018_ambermark_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=9AP26kSxIa4\" target=\"_blank\">Amber Mark, \"Love Is Stronger Than Pride\"</a>",
  "start": 61,
  "title": "Love Is Stronger Than Pride",
  "videoUrl": "https://www.youtube.com/watch?v=9AP26kSxIa4",
  "youtube": true
}, {
  "_id": 24,
  "artist": "Khruangbin",
  "description": "Khruangbin are a trio from Houston with eclectic influences: '60s Thai funk, traditional Spanish and Middle Eastern music, surf rock, psychedelia -- the list is unending. I'm utterly impressed with how well they can blend these influences into a cohesive whole on the largely instrumental \"Friday Morning.\" This was one song in particular that I gravitated to when my busy head needed something both chill and comforting. \"Friday Morning\" contains little in the way of lyrics to convey it, but its title really is perfect. The song operates at exactly the speed and tenor I want to hear in the morning, and especially on a Friday, when the hope of the weekend is imminent.",
  "end": 320,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634690/dbrad2018/best_songs_2018_khruangbin_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=KjQSSYOTXzk\" target=\"_blank\">Khruangbin, \"Friday Morning\"</a>",
  "start": 263,
  "title": "Friday Morning",
  "videoUrl": "https://www.youtube.com/watch?v=KjQSSYOTXzk",
  "youtube": true
}, {
  "_id": 23,
  "artist": "Florence + The Machine",
  "description": "Florence Welch has a flair for the epic, conjuring the spirits of Grace Slick, Janis Joplin, and Robert Plant in the process. \"Hunger\" is tightly constructed with the exact specifications needed to create maximum impact. Welch knows those piano chords in the chorus, combined with her stellar voice and the driving drumbeat, will get anyone pumped. It also helps when she makes the song into a communal anthem. It's not just <i>her</i> that has a hunger for something bigger and better -- it's every one of us. \"We all have a hunger.\"",
  "end": 165,
  "genres": ["ALL", "ROCK", "Alternative"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634897/dbrad2018/best_songs_2018_florencemachine_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=5GHXEGz3PJg\" target=\"_blank\">Florence + The Machine, \"Hunger\"</a>",
  "start": 102,
  "title": "Hunger",
  "videoUrl": "https://www.youtube.com/watch?v=5GHXEGz3PJg",
  "youtube": true
}, {
  "_id": 22,
  "artist": "Lucy Dacus",
  "description": "<p>Lucy Dacus is one of our greatest current songwriters, and so considering how under-the-radar she still is, she is also possibly our most underrated songwriter. \"Night Shift\" is her calling card, a clever and vivid self-exploration after a wrenching breakup.</p><p>Dacus lets us into the whirlwind of distinct, often conflicting thoughts and emotions that come after splitting with someone so close. One moment, she's missing her ex as she kisses someone else for the first time; the next, she calls her ex out for his neglect and lack of respect toward her. The song simmers throughout, calming down and boiling over at just right moments. It ends with a hope that the trove of love songs she's written that no longer apply will be able to achieve new meaning: \"In five years I hope the songs feel like covers dedicated to new lovers.\"</p>",
  "end": 315,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545845922/dbrad2018/best_songs_2018_lucydacus2_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=0WDZdT04ls4\" target=\"_blank\">Lucy Dacus, \"Night Shift\"</a>",
  "start": 228,
  "title": "Night Shift",
  "videoUrl": "https://www.youtube.com/watch?v=0WDZdT04ls4",
  "youtube": true
}, {
  "_id": 21,
  "artist": "Against All Logic",
  "description": "Nicolas Jaar has been celebrated in indie circles for a while, for his brand of experimental, off-kilter electronica. I never got into him all that much, but he released an album under the name Against All Logic this year that really grabbed hold of me. \"I Never Dream\" is <i>mostly</i> an instrumental, not counting the stop-and-start vocal flourishes, like \"Ohhh, Ohhh, I FEEL, I FEEL.\" The track sucks you into a trance. It's accessible in a way that Jaar's music usually isn't -- throw this on at a party, and people will feel the beat.",
  "end": 148,
  "genres": ["ALL", "INDIE", "ELECTRONIC"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545782393/dbrad2018/best_songs_2018_againstalllogic_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=Pg9_pkPXrJw\" target=\"_blank\">Against All Logic, \"I Never Dream\"</a>",
  "start": 89,
  "title": "I Never Dream",
  "videoUrl": "https://www.youtube.com/watch?v=Pg9_pkPXrJw",
  "youtube": true
}, {
  "_id": 20,
  "artist": "Kendrick Lamar ft. SZA",
  "description": "I already considered Kendrick Lamar a genius, but then he curated and produced the Black Panther soundtrack and now my estimation of him has grown and broadened even more. Kendrick has ruled the hip-hop world for years now on the merits of his pure West Coast-style rap. But with \"All the Stars,\" he pushes into widely-appealing pop-rap territory, and guess what? He's good at that too. We should absolutely not shortchange SZA though. Her voice is pure honey, and like Kendrick, her presence on a song automatically turns it to gold.",
  "end": 68,
  "genres": ["ALL", "RAP", "POP", "R&amp;B"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545783450/dbrad2018/best_songs_2018_szakendrick_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=JQbjS0_ZfJ0\" target=\"_blank\">Kendrick Lamar ft. SZA, \"All The Stars\"</a>",
  "start": 29,
  "title": "All The Stars",
  "videoUrl": "https://www.youtube.com/watch?v=JQbjS0_ZfJ0",
  "youtube": true
}, {
  "_id": 19,
  "artist": "Leon Bridges",
  "description": "<p>Leon Bridges first gained attention from his retro, faithfully-rendered version of '60s soul on his debut album. It wasn't original in the slightest, but it was just so good that it didn't matter. He came back this year with his sophomore album, which included an immediate standout -- an invigorating ballad called \"Beyond.\"</p><p>The wedding-ready slow jam is still very much indebted to the past, as is Bridges's style, but \"Beyond\" puts a new spin on old-school soul. It's a sentimental song about the uncertainty of early love and wondering if it will go the distance. There's a lovely line in particular that stands out to me every time I listen \"I wanna bring her 'round to meet you, I think you'd like her kind demeanor, I know that Grandma would've loved her, like she was her own.\" The music itself is warm and sumptuous, too. When I first heard the repeating \"Oh me, oh my, I can't explain! She might just be my everything\" refrain for the first time, I was grinning like an idiot.</p>",
  "end": 186,
  "genres": ["ALL", "R&amp;B", "SOUL"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545781246/dbrad2018/best_songs_2018_leonbridges_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=ELPOCJvDz3w\" target=\"_blank\">Leon Bridges, \"Beyond\"</a>",
  "start": 124,
  "title": "Beyond",
  "videoUrl": "https://www.youtube.com/watch?v=ELPOCJvDz3w",
  "youtube": true
}, {
  "_id": 18,
  "artist": "Thom Yorke",
  "description": "Jonny Greenwood is supposed to be Radiohead's designated \"movie score\" guy -- he has There Will Be Blood, The Master, Phantom Thread, and more to his name. But his bandmate Thom Yorke has now dipped his toes into the soundtrack world, composing the music for Luca Guadagnino's Suspiria, and it turns out Yorke is masterful in that department as well. \"Supsirium\" is the soundtrack's flagship song -- nothing more than a echoey piano, a dash of flute, and Yorke's supernatural singing. Together, they create a stunning work of crystal clear eeriness.",
  "end": 85,
  "genres": ["ALL", "INDIE", "CLASSICAL"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634962/dbrad2018/best_songs_2018_thomyorke_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=BTZl9KMjbrU\" target=\"_blank\">Thom Yorke, \"Suspirium\"</a>",
  "start": 21,
  "title": "Suspirium",
  "videoUrl": "https://www.youtube.com/watch?v=BTZl9KMjbrU",
  "youtube": true
}, {
  "_id": 17,
  "artist": "Pusha T",
  "description": "The coolest rapper alive is Pusha T, from his effortless, knowing swagger, to his surgical obliteration of Drake in their infamous feud. Now, Kanye West was a bit extra this year, with a range of creative peaks and valleys, but his highest peak in 2018 was helming the production of Pusha T's taut, efficient album <i>DAYTONA</i>. \"If You Know You Know\" is the album's calling card, epitomizing Pusha's whole ethos. It goes extremely hard, as Pusha flexes his chilly confidence over a sparse, no-nonsense beat and name-checking the dominant Warriors: \"When we all clicking like Golden State, and you and your team are the motorcade. If you know, you know.\"",
  "end": 90,
  "genres": ["ALL", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634696/dbrad2018/best_songs_2018_pushat_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=L7-0ugujS2U\" target=\"_blank\">Pusha T, \"If You Know You Know\"</a>",
  "start": 41,
  "title": "If You Know You Know",
  "videoUrl": "https://www.youtube.com/watch?v=L7-0ugujS2U",
  "youtube": true
}, {
  "_id": 16,
  "artist": "Travis Scott ft. Drake",
  "description": "<p>The jury was out on Travis Scott for me for a while. I suspected the Houston rapper/singer/curator/Autotune afficionado was somewhat shallow, insubstantial, and, dare I say it, a little corny. But my opinion turned more toward the positive after some choice guest spots on some of last year's best songs, including SZA's \"Love Galore\" and Miguel's \"Sky Walker.\" I didn't have an informed opinion about his solo career at that point, but I knew that I really liked the sound of his voice. I can't really put my finger on why, but the timbre of his voice just appeals to me for some reason, even drenched in Autotune. Then he released <i>Astroworld</i> this year, <a href=\"https://static.metacritic.com/images/products/music/9/633618e40f6a8783f7ed0382443da0b1.jpg\" target=\"_blank\">gaudy album cover</a> and all, and I officially declared Travis Scott as \"good.\"</p><p>\"Sicko Mode\" has three different acts (much like Paul McCartney's \"Band on the Run\" of all things), each of which shines in a unique way. The beats are psychedelic, the charisma is boundless, and the lines are memorable -- \"I did half a Xan, 13 hours till I land, had me out like a light, ayyyy.\"</p>",
  "end": 273,
  "genres": ["ALL", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634897/dbrad2018/best_songs_2018_travisscott_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=6ONRf7h3Mdk\" target=\"_blank\">Travis Scott ft. Drake, \"SICKO MODE\"</a>",
  "start": 239,
  "title": "SICKO MODE",
  "videoUrl": "https://www.youtube.com/watch?v=6ONRf7h3Mdk",
  "youtube": true
}, {
  "_id": 15,
  "artist": "Pinegrove",
  "description": "Sometimes emotional journeys can begin and end in two minutes and nine seconds. The first third of \"Paterson & Leo\" doesn't even have any singing -- just twinkling guitars over a steady bass and drumbeat. By then, you're already enraptured. When the melody kicks in, along with Nandi Rose Plunkett's stalwart vocal harmonies, it's pure bliss. So much feeling packed in such little time.",
  "end": 128,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545783449/dbrad2018/best_songs_2018_pinegrove_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=rZ42l0J2mgI\" target=\"_blank\">Pinegrove, \"Paterson & Leo\"</a>",
  "start": 69,
  "title": "Paterson & Leo",
  "videoUrl": "https://www.youtube.com/watch?v=rZ42l0J2mgI",
  "youtube": true
}, {
  "_id": 14,
  "artist": "Ty Segall",
  "description": "Ty Segall is my hero. The dude just can't stop his constant outpour of hard rock magic. \"Every 1's a Winner\" is a cover of a song by Hot Chocolate, who you may know as the '70s funk outfit that provided us with the classic \"You Sexy Thing.\" Segall keeps the funk feel, but coats it in filthy guitar riffs. From the echoing \"Every one's a winner, baby, that's the truth (that's the truth)\" to the way he inflects his voice at the end of \"Never could believe the way you aaaaaare,\" Segall knows how to let loose and show the listener a good time.",
  "end": 113,
  "genres": ["ALL", "ROCK", "HARD ROCK", "INDIE"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634894/dbrad2018/best_songs_2018_tysegall_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=c2_3gOKr_pg\" target=\"_blank\">Ty Segall, \"Every 1's a Winner\"</a>",
  "start": 60,
  "title": "Every 1's a Winner",
  "videoUrl": "https://www.youtube.com/watch?v=c2_3gOKr_pg",
  "youtube": true
}, {
  "_id": 13,
  "artist": "Drake",
  "description": "<p>\"Kiki, do you love me?\" Drake asks, inspiring a deluge of memes and dance challenges along the way. I can't speak for whether Kiki loves you, Drake, but the Billboard Hot 100 did. \"In My Feelings\" spent 10 weeks on top of the charts, the second-longest tenure for a #1 hit behind... you guessed it: \"God's Plan,\" also by Drake.</p><p>Its popularity can basically be wholly attributed to a comedian named Shiggy, who posted a video of himself dancing to the track that eventually went viral, especially as other celebrities posted videos of their own. The funny thing is, \"In My Feelings\" wasn't even a single at the time. Shiggy explained, \"I like a lot of songs on there but that's the song when I heard it made me move. It made me want to dance. That was the one.\" He made a great choice. The song is bouncy, catchy, and just plain fun.</p>",
  "end": 161,
  "genres": ["ALL", "R&amp;B", "POP", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545784034/dbrad2018/best_songs_2018_drake2_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=DRS_PpOrUZ4\" target=\"_blank\">Drake, \"In My Feelings\"</a>",
  "start": 127,
  "title": "In My Feelings",
  "videoUrl": "https://www.youtube.com/watch?v=DRS_PpOrUZ4",
  "youtube": true
}, {
  "_id": 12,
  "artist": "Natalie Prass",
  "description": "Natalie Prass has always been good at writing songs with killer hooks. But on \"Short Court Style,\" she takes her sound in a different direction, morphing from a plaintive, string-infused, Dusty Springfield style, to a more lush, bouncy, almost funky pop groove with a strong beat. \"You spin me round, had ups and downs, know that I can't be without my love that I have found.\" It's a song not of infatuation, but finding that same joy and excitement out of a mature, lived-in love.",
  "end": 120,
  "genres": ["ALL", "INDIE", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634902/dbrad2018/best_songs_2018_natalieprass_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=0pv7rN-_IWU\" target=\"_blank\">Natalie Prass, \"Short Court Style\"</a>",
  "start": 43,
  "title": "Short Court Style",
  "videoUrl": "https://www.youtube.com/watch?v=0pv7rN-_IWU",
  "youtube": true
}, {
  "_id": 11,
  "artist": "Jay Rock ft. Kendrick Lamar, Future, & James Blake",
  "description": "I was not expecting one of the best rap songs of the year to be a woozy, jittery posse cut soundtracking a big-budget Marvel movie. \"King's Dead\" is uneasy, stuttering forward without evert really getting a hold of itself. Jay Rock and Future each inject their verses with tons of character -- Jay Rock relies on fast repetition, while Future croaks out some outlandish lines (one in particular I won't repeat here, but as a hint, it involves the word \"slob\"). The track then transitions to an intense, hard beat readymade for Kendrick to come in hot and close it out. It's such a weird, glorious song.",
  "end": 82,
  "genres": ["ALL", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634908/dbrad2018/best_songs_2018_jayrock_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=VwAnsAUYnw4\" target=\"_blank\">Jay Rock ft. Kendrick Lamar, Future, & James Blake, \"King's Dead\"</a>",
  "start": 4,
  "title": "King's Dead",
  "videoUrl": "https://www.youtube.com/watch?v=HQUR4a3Y0Qg",
  "youtube": true
}, {
  "_id": 10,
  "artist": "Kali Uchis ft. Tyler, the Creator & Bootsy Collins",
  "description": "Kali Uchis, the rising Colombian-American R&B/pop star, made the best genre-bending summer album of the year, <i>Isolation</i>, with \"After the Storm\" as its hot, sweaty highlight. Uchis takes inspiration from '60s girl groups in her vocals (and the video is based on psychedelic visions of '50s nuclear families), but the woozy, funky production, with its heavy bassline and busy drums, was beamed in straight from the '70s. It makes sense -- Uchis collaborated with legendary Parliament-Funkadelic member Bootsy Collins to help write, sing some vocals, and play that sweet bass. Tyler, the Creator turns in a low-key, pitch-perfect guest rap verse to round out this killer jam.",
  "end": 114,
  "genres": ["ALL", "R&amp;B", "FUNK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634696/dbrad2018/best_songs_2018_kaliuchis_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=9f5zD7ZSNpQ\" target=\"_blank\">Kali Uchis ft. Tyler, the Creator & Bootsy Collins, \"After the Storm\"</a>",
  "start": 65,
  "title": "After the Storm",
  "videoUrl": "https://www.youtube.com/watch?v=9f5zD7ZSNpQ",
  "youtube": true
}, {
  "_id": 9,
  "artist": "The Voidz",
  "description": "<p>Julian Casablancas is a huge weirdo. The Strokes have mostly been inactive the last five years (with the exception of a short 3-song EP), during which Casablancas has now released two albums with his new band, the Voidz. His previous Voidz output was mostly esoteric noise, but now he's made the best song he's released this decade. \"Leave It In My Dreams\" is a light, fun, summery jam.</p><p>Of course, the song still has its eccentricities, like random, incongruous stabs of guitar and Casablancas's signature drawl. How could it not? But, to the benefit of us all, Casablancas has let his natural pop sensibilities get the best of him again. This is the closest he has come to sounding like early-2000s-era Strokes. Please don't hide that part of you, Julian. Let it shine.</p>",
  "end": 223,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634910/dbrad2018/best_songs_2018_thevoidz_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=P1nCVWBTays\" target=\"_blank\">The Voidz, \"Leave It In My Dreams\"</a>",
  "start": 161,
  "title": "Leave It In My Dreams",
  "videoUrl": "https://www.youtube.com/watch?v=P1nCVWBTays",
  "youtube": true
}, {
  "_id": 8,
  "artist": "Kurt Vile",
  "description": "\"Bassackwards\" is almost 10 minutes long, the majority of which is dominated by two chords. Not a promising premise, I'll admit. But Kurt Vile knows what he's doing at this point. \"Bassackwards\" meanders and lazes along, down a winding road through fields of wheat and views of the coastline. It's not in a hurry. Vile's fingerpicking is joined by tasteful blots of psychedelic sound effects, anchored by a simple drum track, as his mind and being wander: \"I was on the beach, but I was thinking about the bay / Got to the bay but by then I was far away.\" It's pure bliss -- something to lose yourself in and vibe out to on a long drive.",
  "end": 241,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634898/dbrad2018/best_songs_2018_kurtvile_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=pOFWHty4XFQ\" target=\"_blank\">Kurt Vile, \"Bassackwards\"</a>",
  "start": 171,
  "title": "Bassackwards",
  "videoUrl": "https://www.youtube.com/watch?v=pOFWHty4XFQ",
  "youtube": true
}, {
  "_id": 7,
  "artist": "Rosal&iacute;a",
  "description": "<p>Rosal&iacute;a was a late discovery for me -- thank goodness I heard \"Malamente\" before the end of the year. Rosal&iacute;a hails from a town outside Barcelona and was reared in the study of flamenco music from a young age. Her 2018 album, <i>El mal querer</i> was actually her final project in anticipation of receiving her bachelor's degree from the Catalonia College of Music.</p><p>\"Malamente,\" the album's opening track, is not your abuela's flamenco -- it's very modern, with equal devotion to R&B and pop. Every element in the song's musical tapestry is excellent and necessary -- the quiet synths, the random vocal lines seemingly coming from all sides, (\"toma que toma,\" \"illo!\") -- but nothing is more important than the percussion. Those handclaps give me life.</p>",
  "end": 88,
  "genres": ["ALL", "FLAMENCO", "R&amp;B", "POP", "LATIN"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634908/dbrad2018/best_songs_2018_rosalia_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=Rht7rBHuXW8\" target=\"_blank\">Rosal&iacute;a, \"Malamente (Cap.1: Augurio)\"</a>",
  "start": 22,
  "title": "Malamente (Cap.1: Augurio)",
  "videoUrl": "https://www.youtube.com/watch?v=Rht7rBHuXW8",
  "youtube": true
}, {
  "_id": 6,
  "artist": "Drake",
  "description": "One thing I feel very passionate about is bequeathing the title of \"Song of the Summer\" each year to whichever hit single best represented the apex of popularity and quality from May to August. \"Bequeath\" is a strong word, because it usually just amounts to me saying in my head, \"Okay, yeah, that's the song of the summer.\" Well at some point this year, I said in my head, \"Yup, it's 'Nice for What.'\" How could it not be, with that Lauryn Hill-sampling, New Orleans-influenced beat brimming with joy? It's endlessly catchy.",
  "end": 81,
  "genres": ["ALL", "RAP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634906/dbrad2018/best_songs_2018_drake_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=U9BwWKXjVaI\" target=\"_blank\">Drake, \"Nice For What\"</a>",
  "start": 36,
  "title": "Nice For What",
  "videoUrl": "https://www.youtube.com/watch?v=U9BwWKXjVaI",
  "youtube": true
}, {
  "_id": 5,
  "artist": "Snail Mail",
  "description": "<p>There's a certain ennui that often takes hold on a blindingly hot summer day, especially if you've just experienced a depressing event. It's hard to dig within yourself and find the focus necessary to snap out of your lethargic funk. As Lindsey Jordan sings (in a brilliant two-part harmony), \"Passing phases wear you thin, same old world that you've been sleeping in.\"</p><p>When listening to \"Heat Wave,\" you can practically see the heat mirage emitting from Jordan's shimmering '90s-power-pop guitar, as she sinks into a swarm of thoughts about a lost love. It feels like she simultaneously wishes both well and ill of her unrequited love when ramping up to sing the cathartic line, \"And I hope the love that you find swallows you wholly, like you said it might.\"</p>",
  "end": 201,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634900/dbrad2018/best_songs_2018_snailmail2_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=-d91Qn8QUks\" target=\"_blank\">Snail Mail, \"Heat Wave\"</a>",
  "start": 138,
  "title": "Heat Wave",
  "videoUrl": "https://www.youtube.com/watch?v=-d91Qn8QUks",
  "youtube": true
}, {
  "_id": 4,
  "artist": "Amber Mark",
  "description": "No one in the R&B world came close to touching Amber Mark's constant rush of brilliance this year. Not only does she have a strong voice, but she has an ear for excellent production. \"Love Me Right,\" a song about a love interest with a complete inability to commit, is full of dynamic, enveloping sounds, allowing Mark's effortlessly smooth voice to permeate its crevices. The production seems so warmly familiar to me, like something I listened to while growing up in the early '90s, but the specific comparison eludes me. All I know is when that key change hits in the last part of the song, it's simply sublime. I can't rave enough about it.",
  "end": 208,
  "genres": ["ALL", "R&amp;B"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545781243/dbrad2018/best_songs_2018_ambermark2_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=EWvXfmwuiHU\" target=\"_blank\">Amber Mark, \"Love Me Right\"</a>",
  "start": 121,
  "title": "Love Me Right",
  "videoUrl": "https://www.youtube.com/watch?v=EWvXfmwuiHU",
  "youtube": true
}, {
  "_id": 3,
  "artist": "Lucy Dacus",
  "description": "<p>I'm endlessly impressed with the way Lucy Dacus can boil a universal experience into its essence, describing it matter-of-factly but still poetically. On \"Pillar of Truth,\" the penultimate track of her breakthrough album <i>Historian</i>, Dacus delivers an emotional knockout punch of a song, reflecting on her grandmother as she slowly succumbs to old age. It revolves around the repeating refrain, \"I am weak looking at you, a pillar of truth, turning to dust.\"</p><p>But Dacus's approach is a heartening one. \"Pillar of Truth\" is ultimately about family, about feeling connected to those before and after you -- \"You are your mother's child. You\"re the mother of a mother of a mother now, raised in the age of the milkman, I can't claim to understand.\" The song's subject matter honestly reminds me of the Pixar movie Coco, in which Miguel learns to maintain the memory of his ancestors. \"Lord, have mercy on my descendants, for they know now what they do, for they know not who you are,\" sings Dacus, alluding to the bible. Dacus peppers the song with southern baptist hymnal imagery to honor her grandmother. That lyrical vision carries over to the music itself, as it builds to an epic climax meant to represent her grandmother reaching heaven. Dacus even sheds her usual dulcet tones for a passionate, \"And my soul screams out to you!\" By the end, \"Pillar of Truth\" is not so much a lament, but a celebration.</p>",
  "end": 210,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634901/dbrad2018/best_songs_2018_lucydacus_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://open.spotify.com/track/0n7UlTyt1ENJgkFHoH0bhk?si=oY9cEnKyRlaoDMr894cJNQ\" target=\"_blank\">Lucy Dacus, \"Pillar of Truth\"</a>",
  "start": 88,
  "title": "Pillar of Truth",
  "videoUrl": "https://www.youtube.com/watch?v=Gjg2-Yq-g3Q",
  "youtube": true
}, {
  "_id": 2,
  "artist": "Soccer Mommy",
  "description": "<p>Look, I try to make this a family-friendly blog. I want you to be able to listen to the music from these lists with your kids (or your mom) in the room. However, I regret to inform you that you should <i>not</i> listen to this year's second-best song with just anyone around. The first line literally says \"I don't want to be your f***ing dog,\" clear as crystal. But that's what it takes for Sophie Allison to express her rightfully thorough disgust with the type of guy that keeps finding ways to constrict her.</p><p>My favorite part of \"Your Dog\" is that massive, chunky bass combined with the wobbly guitar lick, the catharsis of which is difficult for me to adequately convey. There were so many times this year when I was walking around listening to \"Your Dog\" turned all the way up on my headphones and I was just in awe of how badass it sounded. I haven't heard a grunge song sound that good, that deeply resonant, that full of both darkness and life since Nirvana. I don't say that lightly.</p>",
  "end": 92,
  "genres": ["ALL", "INDIE", "ROCK"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545781246/dbrad2018/best_songs_2018_soccermommy2_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=Ouem6cFXJvA\" target=\"_blank\">Soccer Mommy, \"Your Dog\"</a>",
  "start": 33,
  "title": "Your Dog",
  "videoUrl": "https://www.youtube.com/watch?v=Ouem6cFXJvA",
  "youtube": true
}, {
  "_id": 1,
  "artist": "Kacey Musgraves",
  "description": "<p>If you know me, you know my relationship with country music has never exactly been harmonious. When it comes down to it, I enjoy country most when it's poured into a mix with other genres folk, rock, Americana, etc. Kacey Musgraves's new album, <i>Golden Hour</i>, achieves that genre mixture with aplomb, which is a significant reason why I'm in love with it. However, I'm sure my requirement that country music be made more \"palatable\" by diluting it with other styles of music would be quickly dismissed by Musgraves and many of her fans that have been with her since the beginning. I'm okay with that. I realize I'm a latecomer to the Kacey Musgraves train, but I can't help hopping on when she records an absolute stunner like \"Slow Burn.\"</p><p>The music literally embodies its title, starting with a simple acoustic guitar and building with the gradual addition of bass, drums, banjo, background harmonies, and some violin touches, which come together to form a delicate tapestry of sound. In true country fashion, the vocals are characterized by their clarity, specific images, and clever turns of phrase -- \"Born in a hurry, always late, haven't been early since '88.\" Musgraves is teeming with an admirable self-confidence here, advocating for an unhurried approach to life and love. My favorite line comes at the end, as Musgraves assures us that there's time to figure it all out -- \"Old soul, waiting my turn, I know a few things, but I still got a lot to learn, so I'm alright with a slow burn.\"</p><p>\"Slow Burn\" is calm and contemplative, intimate and perfectly executed. It has been my companion during quiet mornings, serene sunsets, and starry night drives. It is my favorite song of 2018.</p>",
  "end": 247,
  "genres": ["ALL", "COUNTRY", "POP"],
  "imgURL": "https://res.cloudinary.com/ddvn6aemk/image/upload/v1545634904/dbrad2018/best_songs_2018_kaceymusgraves_desktop-01.png",
  "listen": "<b>Listen:</b> <a href=\"https://www.youtube.com/watch?v=NC7cmWkBoz4\" target=\"_blank\">Kacey Musgraves, \"Slow Burn\"</a>",
  "start": 1,
  "title": "Slow Burn",
  "videoUrl": "https://www.youtube.com/watch?v=NC7cmWkBoz4",
  "youtube": true
}]