{ 
  "songs": [
     {
       "artist": "Spoon",
       "title": "Hot Thoughts",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_north,h_700,w_1300/v1513194248/dbrad2017/large/best_songs_2017_spoon.jpg",
       "songURL": "https://www.youtube.com/watch?v=XrLVAQYfeZ4",
       "description": "Spoon, the most consistently good band currently working, and one of my 10 favorite bands of all time, dropped another gem this year. 'Hot Thoughts' is a swaggering, sinewy jam, perfect for a future James Bond theme song. The sudden bursts of guitar interweave with the jangling bells, swooping strings, and moving bass line to make a nice groove to complement Britt Daniel's passionate yelps.",
       "_id": 10,
       "photoCredit": "Tom Hines"
     },
     {
       "artist": "Hurray for the Riff Raff",
       "title": "Hungry Ghost",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_south,h_700,w_1366/v1513194168/dbrad2017/large/best_songs_2017_hurray_riff_raff.jpg",
       "songURL": "https://www.youtube.com/watch?v=6xRJ-MuN46E",
       "description": "Hurray for the Riff Raff is the brainchild of Alynda Segarra, a Puerto Rican woman born and raised in the Bronx. It's hard to explain the satisfying elation I felt when I first put on her new album, <i>The Navigator</i>. Part rock, part blues, part folk, part bomba/salsa, <i>The Navigator</i> is a vivid melting pot of genres and cultures. But on top of that, the songwriting is excellent and Segarra's voice is powerful. 'Hungry Ghost' is a propulsive, brilliant blend of 2000s indie and 1970s rock and roll. You can feel the energy that's bubbling just below the surface, breaking through in quick bursts of chorus. It's perfectly crafted and deeply gratifying.",
       "_id": 9,
       "photoCredit": "Sarrah Danziger"
     },
     {
       "artist": "Courtney Barnett & Kurt Vile",
       "title": "Over Everything",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_north,h_700,w_1366/v1513210007/dbrad2017/large/best_songs_2017_barnett_vile.jpg",
       "songURL": "https://www.youtube.com/watch?v=3KNsBCf34fQ",
       "description": "You know that feeling that comes every so often when you're surrounded by people you like and you feel as comfortable and content as possible? 'Over Everything' gives me that same feeling. It might be partially due to my undying love for both the artists featured here: the low-key hilarious Australian rocker Courtney Barnett and chill, introspective Philly-native Kurt Vile. No one had any inkling that the two would make music together, let alone a full album's worth, but they formed a mutual respect of each other's work, leading to a friendship and collaboration. But aside from my feelings for the artists, 'Over Everything' just feels like putting on a huge warm sweater. Vile and Barnett trade verses, not to mention trade both acoustic and electric guitars, as they kick back and let the groove wash over us. 'Over Everything' is the pure essence of contentment, diluted into song form.",
       "_id": 8,
       "photoCredit": "Courtney Barnett & Kurt Vile/Matador"
     },
     {
       "artist": "The War on Drugs",
       "title": "Pain",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_south,h_700,w_1366/v1513194079/dbrad2017/large/best_songs_2017_war_on_drugs_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=J9LgHNf2Qy0",
       "description": "The War on Drugs' new album, A Deeper Understanding, is a revelation. It's stunning, an introspective masterpiece where every single song makes you feel alive. 'Pain' is as good a representative as any of the cathartic joys contained on the album. First-time listeners may be reminded of the 'heartland rock' of the 1980s, with some resemblance to Bruce Springsteen, Tom Petty, or Neil Young, with Dylan-esque vocals to top it off, but I think the comparison is a bit reductive. As transcendent as those predecessors surely are, Tom Petty and Neil Young never reached the sonic heights of 'Pain.' It's a dreamy, almost ethereal song that stays grounded by it's reliable beat and satisfying guitar work. It just blows me away.",
       "_id": 7,
       "photoCredit": "Dusdin Condren"
     },
     {
       "artist": "Kendrick Lamar",
       "title": "DNA.",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_700,w_1366/v1513672803/dbrad2017/large/best_songs_2017_kendrick_lamar_3.jpg",
       "songURL": "https://www.youtube.com/watch?v=JCnCZvkaYu8",
       "description": "<p>The most surprising, downright awesome musical moment of 2017 was hearing the transition between 'BLOOD.' and 'DNA.', the first two tracks on Kendrick's album <i>DAMN.</i> Near the end of 'BLOOD.', the slow, sweet lilt abruptly ends in a gunshot. A clip from Fox News gradually fades in -- the anchor mockingly quotes Lamar's lyrics from 'Alright,' to which another anchor responds, 'Oh please. Ugh! I don't like it.' Then all of a sudden Kendrick's voice comes in with 'I GOT I GOT I GOT I GOT loyalty, got royalty inside my DNA.' It's honestly mind-blowing in both content (taking someone's disdain for you and deciding to broadcast it) as well as execution (that lead-in to the hard, pounding beat is insane).</p><p>The rest of 'DNA.' is just as powerful. About halfway through, that beat gives way to a snippet of Geraldo Rivera asserting that 'Hip-hop has done more damage to young African Americans than racism in recent years.' A countdown of '5, 4, 3, 2, 1' accompanies Kendrick's furious rapping before the beat switches to a heaving, seething crawl. It's physical, visceral, phenomenal.</p><p>If you want to hear the 'BLOOD.' -> 'DNA.' transition, here's a <a href='https://www.youtube.com/watch?v=bhCfQ8BGow8'>clip from the MTV VMA's</a>. It's not quite as good as on the album, but it will do.</p>",
       "_id": 6,
       "photoCredit": "Kendrick Lamar"
     },
     {
       "artist": "Sampha",
       "title": "(No One Knows Me) Like the Piano",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_700,w_1366/v1513193952/dbrad2017/large/best_songs_2017_sampha.jpg",
       "songURL": "https://www.youtube.com/watch?v=_NSuIYwBxu4",
       "description": "Sampha's unique voice has been featured by numerous pop stars, including Drake, Solange, and Beyonce, but he finally gave us a solo offering in 2017, including the stirring ballad '(No One Knows Me) Like the Piano.' Pianos have been a prominent fixture in my life, especially the upright Weber at my childhood home in Pasadena. I wouldn't have learned how to play if it weren't for my mom's encouragement. When Sampha sings, 'No one knows me like the piano in my mother's home,' it seems like he's speaking directly to me. The piano chords adorning the song are exquisitely poignant (it sounds like you're right there in the living room with him), and Sampha's vocals are bare and full of muted passion and yearning for familiarity.",
       "_id": 5,
       "photoCredit": "Andy Parsons"
     },
     {
       "artist": "Rostam",
       "title": "Gwan",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_face:center,h_700,w_1366/v1513193898/dbrad2017/large/best_songs_2017_rostam.jpg",
       "songURL": "https://www.youtube.com/watch?v=sIQ2atEdfII",
       "description": "<p>Sometimes a song is so stunningly beautiful that it stops you in your tracks. 'Gwan' is one of those songs. Rostam Batmanglij was one of the key members of Vampire Weekend, playing an important role in shaping the group's unique baroque-pop sound, before exiting the band early last year to focus on his solo material. I've always liked and respected Rostam's music and various contributions, but I didn't fall in love with him until 'Gwan.'</p><p>'Gwan' is built on a gorgeous string arrangement, buttressed by occasional piano, bells, and muted drums. Rostam lets the strings do the work, especially about two-thirds of the way through the song when everything else drops out, leaving those exquisite violins and cellos to capture our imagination, while he sings about <a href'https://genius.com/Rostam-gwan-lyrics'>'listen[ing] to what your subconscious mind is trying to say to you.'</a> You can feel Rostam's contentment seeping through the song. He sounds self-assured, confident, and happy to be doing what he loves. There's so much emotion and beauty packed into these five minutes that whenever I listen to it, memories and scenes from my life spring to mind in vivid detail. 'Gwan' is incredibly moving, and we're lucky to have it.</p>",
       "_id": 4,
       "photoCredit": "Alex John Beck"
     },
     {
       "artist": "Lorde",
       "title": "Perfect Places",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_700,w_1366/v1513193836/dbrad2017/large/best_songs_2017_lorde.jpg",
       "songURL": "https://www.youtube.com/watch?v=J0DjcsK_-HY#t=35s",
       "description": "<p>Lorde's album <i>Melodrama</i> is supposed to loosely be about a house party. 'Green Light,' which appeared earlier on this list, is the beginning of that party; 'Perfect Places' is the end, when the night (or early morning) comes to a close. Lorde examines how we spend these moments of our youth looking for 'perfect places' to be - at <i>that</i> party, with <i>those</i> friends, etc. - but how it's all fleeting and elusive.</p><p>The track builds to an absolutely epic ending. The last minute of the song is pure perfection, as Jack Antonoff's excellent production broadens and reaches catharsis. Then, at the very end, all of a sudden, everything drops out except for the piano and Lorde's voice, as she sings: 'All the nights spent off our faces / Trying to find these perfect places / What the f--- are perfect places anyway?' I can't express how brilliant it is. The last minute gives me goosebumps every time. I highly recommend listening to this song on headphones and getting lost in your mind as you listen to it. (Clean version <a href='https://open.spotify.com/track/24R0xROgtKAl9ST4GpHkMD'>here)</a></p>",
       "_id": 3,
       "photoCredit": "Andrew Whitton"
     },
     {
       "artist": "Calvin Harris ft. Frank Ocean & Migos",
       "title": "Slide",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_face:center,h_700,w_1366/v1513193796/dbrad2017/large/best_songs_2017_calvin_harris.jpg",
       "songURL": "https://www.youtube.com/watch?v=8Ee4QjCEHHc",
       "description": "<p>Calvin Harris, the electro-dance producer (and fairly recent Taylor Swift flame), decided to team up with two <i>completely</i> different artists for 'Slide' -- the introspective and ingenious soul-singer Frank Ocean, and Atlanta trap-rap kings Migos, who took over 2017 with their chart-topping single, 'Bad and Boujee' (also featured on this list). 'Slide' features an unexpected collision of worlds, but it ultimately works in the best possible way. Harris's silky, shimmery beat is an immediate earworm - a mood-setter for those laid-back July barbecues.</p><p>Frank Ocean is the song's anchor, and I love when he drops the pitched-up 'I might!' during the verses as the beat drops out. But my favorite part is the verse by Offset, one of the two 'Migos' that appear. His fast flow punches the track up a notch, bringing it from 'really good' to 'great.'</p><p>I was a fan the first time I heard 'Slide,' and my love for the song has only grown each time I've listened. If this wasn't your song of the summer this year, then you missed out.</p>",
       "_id": 2,
       "photoCredit": "42 West"
     },
     {
       "artist": "The War on Drugs",
       "title": "Strangest Thing",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_south,h_700,w_1366/v1513193683/dbrad2017/large/best_songs_2017_war_on_drugs.jpg",
       "songURL": "https://www.youtube.com/watch?v=bvmEYgFsgyg",
       "description": "<p>It was not immediately apparent to me what my #1 song of the year would be. All I know is that I kept coming back to 'Strangest Thing' again and again. It spoke to my soul like no other song. It was what I wanted to hear on a foggy morning, on a clear afternoon, during a kaleidoscopic sunset, or in the dead of night. It's meant to be the soundtrack to your life as you take in the world. How could that not be #1?</p><p>'Strangest Thing' is a slow song that starts softly. The first minute surely sounds pleasant, but #1-worthy? Just wait. It gradually picks up steam, slowly increasing in intensity and instrumentation, as frontman Adam Granduciel sets the scene: 'now the sky is painted in a wash of indigo' and giving us a peek into his complex emotions, 'living in the space between the beauty and the pain.' The song builds to a satisfying wordless chorus, followed by a sublimely epic, yet tasteful, guitar solo.</p><p>One of the more impressive things about 'Strangest Thing' is how it basically amounts to an '80s rock ballad, but manages to evade any superfluous cheesiness you would expect from the genre. It just has the good stuff. The whole song is beautiful and detailed, contemplative and exhilarating.</p> <p>Despite my always calling it 'Stranger Things' by accident, 'Strangest Thing' is absolutely my favorite song of 2017.</p>",
       "_id": 1,
       "photoCredit": "Shawn Brackbill/The War on Drugs"
     }
	]
}