{ 
  "songs": [
    {
       "artist": "Ryan Adams",
       "title": "Do You Still Love Me?",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513671753/dbrad2017/small/best_songs_2017_ryan_adams_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=GzZ7HvSnDQo",
       "description": "Ryan Adams's recent full-blown embrace of 1980s anthem rock has led to some pretty excellent music in the last few years, starting with 2014's self-titled album and continuing with his <a target='_blank' href='https://dbradmusic.com/2015/09/25/poptimism-won-2015-who-won-1989/'>front-to-back cover of Taylor Swift's <i>1989</i></a>. 'Do You Still Love Me?' is another mid-tempo, heartland rocker that starts and stops with bursts of guitar and floating organ lines, building to a very satisfying chorus. It's like Bruce Springsteen, Tom Petty, and Foreigner all wrapped into a delicious package. I would have loved this as a classic-rock-obsessed high-schooler. The song does not qualify as original or challenging in any sense of those words, but sometimes you just need to relax with some comfort food.",
       "_id": 50,
       "photoCredit": "NPR"
     },
     {
       "artist": "Carly Rae Jepsen",
       "title": "Cut to the Feeling",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513669551/dbrad2017/small/best_songs_2017_official_carly_rae_jepsen.jpg",
       "songURL": "https://www.youtube.com/watch?v=o97_jDomyqc",
       "description": "Carly Rae Jepsen, more fittingly referred to as Carly Slay Jepsen, is obviously still best known for the iconic <a target='_blank' href='https://www.youtube.com/watch?v=fWNaR-rxAic'>'Call Me Maybe'</a>, but ignore her other output at your peril. It's a crime that 'Cut to the Feeling,' Exhibit A of a stellar pop song, doesn't get any radio play. It's all there -- the sticky melody, the bulletproof chorus, the '80s drums and 'chicka-chicka' guitars, the exhilaration, the sense of wonder. What more do you have to do?",
       "_id": 49,
       "photoCredit": "Carly Rae Jepsen"
     },
     {
       "artist": "Vince Staples",
       "title": "Big Fish",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513670012/dbrad2017/small/best_songs_2017_vince_staples_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=0l9kzS_B7gg",
       "description": "Vince Staples made his name on bleak, L.A./West Coast style rap, but in 2017, he debuted a new sound -- more electronic, more clubby. 'Big Fish' bangs hard, with a deep synth beat and insanely catchy chorus of 'I was up late night ballin', counting up hundreds by the thousand.' The song probably takes the spot as Vince's most 'party-ready' song, in spite of its reflective lyrics: 'Shoulda been dead broke, shoulda been chalked out / But it didn't happen, now it's time to get cracking.'",
       "_id": 48,
       "photoCredit": "Bobby Doherty/Vulture"
     },
     {
       "artist": "Broken Social Scene",
       "title": "Hug of Thunder",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513373287/dbrad2017/small/best_songs_2017_broken_social_scene.jpg",
       "songURL": "https://www.youtube.com/watch?v=n9ujF9s48Z8",
       "description": "During the 2000's, the Canadian collective Broken Social Scene authored some of the best indie rock/pop of the decade. This year, they proved they haven't lost a step. Feist fronts the subtle 'Hug of Thunder,' a song that doesn't try to do too much. It maintains a hypnotic groove and builds to a satisfying chorus featuring the line 'All along we're going to feel some numbness / Oxymoron of our lives.'",
       "_id": 47,
       "photoCredit": "Norman Wong"
     },
     {
       "artist": "RAC ft. Rostam",
       "title": "This Song",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513373121/dbrad2017/small/best_songs_2017_rac.jpg",
       "songURL": "https://www.youtube.com/watch?v=LcA0RmXnWhU",
       "description": "RAC, the Portuguese DJ and remix artist, teamed up with Rostam (the former 'Vampire Weekender' who makes another appearance on this list) for this song, called' well, 'This Song.' The electronic jam is breezy and summery, almost effortless-sounding. Also, my mom heard this song on NPR and told me she liked it, so that's cool.",
       "_id": 46,
       "photoCredit": "RAC/Claire Marie Vogel"
     },
     {
       "artist": "Portugal. The Man",
       "title": "Feel It Still",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513373031/dbrad2017/small/best_songs_2017_portugal_the_man.jpg",
       "songURL": "https://www.youtube.com/watch?v=pBkHHoOIIn8",
       "description": "It's hard to stress how crazy it is that Portugal. The Man have such a huge hit. The band has toiled away in indie circles for over 10 years, with eight albums under their belt before crossing over and hitting it big with 'Feel It Still.' They sing 'I've been feeling it since 1966,' which is a lie because they weren't born, but the sentiment is indeed true -- 'Feel It Still' is indebted to '60s soul, but builds on it with its punched-up production value.",
       "_id": 45,
       "photoCredit": "Portugal. The Man"
     },
     {
       "artist": "Kendrick Lamar ft. U2",
       "title": "XXX.",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_scale,w_272/v1513372410/dbrad2017/small/best_songs_2017_kendrick_lamar_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=YmMrmG8XLhs",
       "description": "<p>Every track on Kendrick Lamar's fourth album, <i>DAMN.</i>, feels vital and urgent. It doesn't matter if Kendrick is rapping fast or slow, over a fiery or chill beat -- he has something to say, and you're going to hear it. 'XXX.' combines the fast and slow, fiery and chill, to make a pointed statement about America.</p><p>'XXX.' puts Kendrick's inner conflict and dual personalities on display. It starts slow, with a chorus singing 'America, God Bless you if it's good to you. America, please take my hand. Can you help me understand?' After a few verses, Kendrick dials up the fury, and over a police siren-laden beat, raps about his loyalty to those closest to him, promising violence against anyone that violates them. 'Ain't no black power when your baby killed by a coward.' But then, the beat lets up as he says 'Alright kids, let's talk about gun control.' A moment of clear-headedness causes Kendrick to think twice about violence.</p><p>And then comes U2. Before releasing <i>DAMN.</i>, Kendrick posted a photo of the cover art, and there it was in the tracklist, dropped like a bomb: 'XXX. ft. U2.' U2? <b>Oh no, Kendrick's jumped the shark.</b> It's not a question of '<i>will</i> the rap song with Bono be cheesy?' but '<i>how</i> cheesy will the rap song with Bono be?' But the U2 feature is so well done, understated and tasteful. Over a soulful beat, Bono sings about the idea of America not as a place, but as a sound: 'It's not a place / This country is to me a sound of drum and bass / You close your eyes and look around.'</p><p>I would say the U2 feature is perfect, but Kendrick follows it up with an even more perfect verse, continuing the introspective personality he switched to on the gun control lyric: 'Hail Mary, Jesus and Joseph / The great American flag is wrapped and dragged with explosives.' 'It's murder on my street, your street, back streets / Wall Street, corporate offices / Banks, employees, and bosses with / homicidal thoughts; Donald Trump's in office / We lost Barack and promised never to doubt him again'' And then the kicker: '<b>But is America honest, or do we bask in sin?</b> Pass the gin, I mix it with American blood.' Kendrick ends it with quite possibly the most thought-provoking lyric on the whole album: 'You overnight the big rifles, then tell Fox to be scared of us / Gang members or terrorists, et cetera, et cetera / <b>America's reflections of me, that's what a mirror does</b>.'</p>",
       "_id": 44,
       "photoCredit": "Vlad Sepetov/Top Dawg/Aftermath/Interscope"
     },
     {
       "artist": "Father John Misty",
       "title": "Ballad of the Dying Man",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_face:center,h_272,w_272/v1513372406/dbrad2017/small/best_songs_2017_father_john_misty.jpg",
       "songURL": "https://www.youtube.com/watch?v=QVaafph6HSQ",
       "description": "<p>Sometimes there's WAY too much gimmicky news about Father John Misty (née Josh Tillman), whether it's explaining in a somewhat unbearable manner <a target='_blank' href='http://www.stereogum.com/1924180/father-john-misty-i-will-ride-for-nickelback/news/'>why he likes a Nickelback song</a>, <a target='_blank' href='http://www.stereogum.com/1841416/father-john-misty-teaches-you-how-to-stop-dressing-like-a-graphic-designer/news/'>musings on fashion</a>, or just admitting that he can <a target='_blank' href='http://www.stereogum.com/1929879/father-john-misty-talks-microdosing-pop-music-and-being-kind-of-annoying/news/'>be kind of annoying</a> in yet another interview. But if that's the price we must pay for his undeniable talent, then it's worth it. Tillman's latest album, <i>Pure Comedy</i>, goes heavy on mid-tempo ballads and low on variety, but every song is executed so beautifully, complete with his expectedly clever lyrics and his amazing voice. Seriously though, that voice. I'll venture to say that it's the most beautiful voice currently in indie, and certainly one of the top 10 voices in all of music right now.</p><p>'Ballad of the Dying Man' sounds a lot like an Elton John song, except with a heavy dose of sarcastic wit. It tells the tale of a man who spends his life self-importantly critiquing the world, but laments the fact that his imminent death means he'll no longer get to grace us with his opinions. The dying man sings 'Just think of all the overrated hacks running amok / And all of the pretentious, ignorant voices that will go unchecked.' The last verse is particularly thought-provoking, as the man realizes he's maybe not as all-knowing as he thought: 'Eventually the dying man takes his final breath / But first checks his news feed to see what he's 'bout to miss / And it occurs to him a little late in the game / We leave as clueless as we came.'</p><p>It's all pretty hilarious and hits the nail on the head when it comes to describing our collective obsession with sharing everything we think on social media, regardless of whether anyone else cares or not. The music itself is beautiful, ending with a particularly gorgeous chorus of 'ohhs' and 'ahh's from a gospel choir. Tillman can be a tad insufferable, but man if he isn't smart and incredibly skilled at making music.</p>",
       "_id": 43,
       "photoCredit": "Guy Lowndes/Sub Pop"
     },
     {
       "artist": "Charly Bliss",
       "title": "Black Hole",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_faces:center,h_272,w_272/v1513372403/dbrad2017/small/best_songs_2017_charly_bliss.jpg",
       "songURL": "https://www.youtube.com/watch?v=7FAVrWqnCdo",
       "description": "Brooklyn-based Charly Bliss, the four-piece power pop / indie punk band, boasts a cohesive rock sound that channels everything from '90s Weezer-style alt-rock, Raincoats-style post-punk, and early 2000's pop-rock. 'Black Hole' has a huge sing-along chorus and killer melody. The best part is about two minutes in when it quiets down before a slow build, short silent pause, and then an explosion into a key change, later greeted by some background harmonies singing 'ahhh-ahhh' over the giant guitar riffs. Oh man, it's excellent.",
       "_id": 42,
       "photoCredit": "Jacqueline Harriet"
     },
     {
       "artist": "Ty Segall",
       "title": "Orange Color Queen",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513671500/dbrad2017/small/best_songs_2017_ty_segall_3.jpg",
       "songURL": "https://www.youtube.com/watch?v=7RpZ8r7rEgw",
       "description": "Ty Segall, the blonde Laguna Beach rocker whose image graces the top of the <a href='http://dbradmusic.com' target='_blank'>dbradmusic.com</a> home page, is one of the hardest working and most consistent musicians out there, regularly releasing at least one and sometimes as many as three solid albums per year. He is best known for garage rock of varying levels of intensity, but he also has an innate knack for pop songwriting. Instead of going for the gut, Segall goes for the heart on 'Orange Color Queen.' Sounding like <a target='_blank' href=''https://www.youtube.com/watch?v=9tY9D5Hikgw'>Brendan Benson</a> (of Raconteurs fame) or a Beatles' <i>White Album</i> outtake, Segall trades in the electric guitar for an acoustic and sings a love song with an impeccable melody for his significant other.",
       "_id": 41,
       "photoCredit": "Sharon Alagna"
     },
     {
       "artist": "Yaeji",
       "title": "raingurl",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513372384/dbrad2017/small/best_songs_2017_yaeji.png",
       "songURL": "https://www.youtube.com/watch?v=_3T8KznhThQ",
       "description": "Airy, intoxicating, clubby, and hilarious. That's how I would describe 'raingurl' by Yaeji, a house producer who splits time between New York City and Seoul, Korea. 'raingurl' is just a straight-up bleary-eyed blast, with a deep bass-heavy beat that is currently causing me to dance around the house in between writing these sentences. Yaeji sing-raps in both English and Korean, trading off until the instantly memorable chorus, where she says, 'Mother Russia in my cup / And my glasses fogging up / Oh yeah, hey dog, hey what's up / (Oh yeah, hey dog, hey what's up),' followed by 'When the sweaty walls are banging / I don't f--- with family planning / Make it rain gurl, make it rain.' It's amazing. Someday before I die, I want to hear this song in a club or at a dance party late at night and go crazy.",
       "_id": 40,
       "photoCredit": "Yaeji"
     },
     {
       "artist": "Arcade Fire",
       "title": "Everything Now",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513372362/dbrad2017/small/best_songs_2017_arcade_fire.jpg",
       "songURL": "https://www.youtube.com/watch?v=zC30BYR3CUk#t=46s",
       "description": "'Everything Now' wins this year's award for 'best song on a bad album.' Arcade Fire, one of the most beloved and critically-acclaimed indie bands of the 21st century, released an empty whimper of an album in 2017, also called <i>Everything Now</i>. Half of the record's songs are half-baked, and almost all of them heavy-handed. Okay, technology and consumerism is bad, we get it. When the title track originally came out, I was not a fan. What's with the repetitive, basic chorus? 'Everything now! (I need it), everything now! (I want it)'? What's with the disco vibes? And is... is that a pan flute in there? It was very jarring, and it didn't help that the album as a whole was a disappointment. But <i>man</i>, 'Everything Now' is just so well constructed and executed. Every time I heard the song, I liked it better than the last time, bouncing my head to the strings, pan flute, and ABBA-like piano. Despite its context, 'Everything Now,' is extremely catchy.",
       "_id": 39,
       "photoCredit": "Guy Aroch/PR"
     },
     {
       "artist": "Turnover",
       "title": "Super Natural",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_faces:center,h_272,w_272/v1513669364/dbrad2017/small/best_songs_2017_wiki_turnover.jpg",
       "songURL": "https://www.youtube.com/watch?v=b7OGvulBkuo",
       "description": "There are some bands that just excel at making songs that sound cinematic, songs that conjure feelings of nostalgia - <a target='_blank' href='https://www.youtube.com/watch?v=-gSE2NK8SDQ'>Real Estate</a> immediately comes to mind. 'Super Natural' sounds a bit like Real Estate, with its lilting, ringing guitars, but with a slightly more direct confrontation of emotion in its sound. The lyrics are as alluringly wistful as you would imagine, like when he sings 'I don't know how but I can say that I found my religion / When nothing was ahead of us that week in California.' This is the kind of low-key song that doesn't get a lot of exposure, but absolutely should, because it has the ability to appeal to a lot of people with diverse tastes.",
       "_id": 38,
        "photoCredit": "Manny Mares/Run for Cover"
     },
     {
       "artist": "Harry Styles",
       "title": "Sign of the Times",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513372325/dbrad2017/small/best_songs_2017_harry_styles.jpg",
       "songURL": "https://www.youtube.com/watch?v=qN4ooNx77u0",
       "description": "Yup, you're reading that correctly. Harry Styles, the 1D heartthrob, is making an appearance on a 'D-Brad's Best Songs' list. Styles's first solo album since leaving One Direction is extremely solid, taking cues from classic rock and '90s Britpop. 'Sign of the Times' is a heart-on-sleeve ballad in the way of David Bowie or Queen, and Styles's voice fits that genre like a glove. I thought <a target='_blank' href='http://www.cnn.com/2017/07/22/entertainment/harry-styles-dunkirk/index.html'>'Dunkirk' would be my only interaction</a> with Harry Styles's work in 2017, but I was wrong.",
       "_id": 37,
       "photoCredit": "Harley Weir"
     },
     {
       "artist": "The National",
       "title": "The System Only Dreams in Total Darkness",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513671340/dbrad2017/small/best_songs_2017_the_national_2.png",
       "songURL": "https://www.youtube.com/watch?v=2O6duDDkhis",
       "description": "The National don't 'rock out' that often, usually opting for more deliberate mood pieces, but they let their hair down a little bit on 'The System Only Dreams in Total Darkness.' The song is built on an insanely catchy drum beat and bass line, with that punchy five-note guitar riff punctuating the song throughout. There's even a guitar solo! Matt Berninger's comforting baritone, the one we know and love, is present here, but my favorite part is when he passionately raises his voice an octave, exclaiming 'I cannot explain it, ahh-ahhh, any other, any other way!' The song is incredibly gratifying.",
       "_id": 36,
       "photoCredit": ""
     },
     {
       "artist": "Jaws of Love.",
       "title": "Jaws of Love.",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513372693/dbrad2017/small/best_songs_2017_jaws_of_love.jpg",
       "songURL": "https://www.youtube.com/watch?v=RefDfo3Y_Wc",
       "description": "Jaws of Love. is a solo project from Kelcey Ayer, one of the key vocalists and songwriters for Local Natives. His new song, also called 'Jaws of Love.', is a gorgeous piano ballad that builds to a satisfyingly cinematic closing groove.",
       "_id": 35,
       "photoCredit": "Lani Trock"
     },
     {
       "artist": "SZA",
       "title": "Prom",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_face:center,h_272,w_272/v1513372296/dbrad2017/small/best_songs_2017_sza_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=CAgzfcWAlTo",
       "description": "SZA made the best R&B album of 2017, but on 'Prom,' she hews closer to pop. 'Prom' is gorgeous, boasting magnificently lush production as SZA apologizes to a partner for not being on the same page, asking for patience and that he not 'take it personal, like I know you usually do.'",
       "_id": 34,
       "photoCredit": "Bryan Derballa/Rolling Stone"
     },
     {
       "artist": "Kamasi Washington",
       "title": "Truth",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_south,h_272,w_272/v1513372283/dbrad2017/small/best_songs_2017_kamasi_washington.jpg",
       "songURL": "https://www.youtube.com/watch?v=rtW1S5EbHgU",
       "description": "Kamasi Washington has been playing jazz for over a decade, breaking through with his appropriately-titled 2015 album, <i>The Epic</i>, but he made himself known to me after Kendrick Lamar featured his jazz stylings on his instant classic from two years ago, <i>To Pimp a Butterfly</i>. He's come out with a new EP entitled <i>Harmony of Difference</i>, with 'Truth' as its exquisite centerpiece. On 'Truth,' Washington's arrangement and mastery of the tenor sax recalls John Coltrane in his <i>A Love Supreme</i> days. At 13 minutes long, 'Truth' never gets old ' it constantly finds new ways to excite while holding to its central motif, providing an almost euphoric experience throughout.",
       "_id": 33,
       "photoCredit": "Awol Erizku/New York Times"
     },
     {
       "artist": "Maggie Rogers",
       "title": "Dog Years",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_face:center,h_272,w_272/v1513372375/dbrad2017/small/best_songs_2017_maggie_rogers.jpg",
       "songURL": "https://www.youtube.com/watch?v=NgWC5oEuyjU",
       "description": "My wife and I were talking the other day about qualities that we look for in music. I decided that for me, if a song is either exhilarating or wistful, then it's right in my wheelhouse. And if it combines those two feelings, even better. 'Dog Years' fits that bill. Maggie Rogers notably broke onto the scene after playing one of her <a target='_blank' href='https://www.theguardian.com/music/2017/mar/16/maggie-rogers-pharrell-williams-speechless-tumbled-15-minutes-alaska'>songs at an NYU music class and stunning Pharrell Williams</a> in the process (I highly recommend <a target='_blank' href='https://www.youtube.com/watch?v=FAM1N1APk80'>watching the video of Pharrell's reaction</a>). Rogers is so great at conjuring introspection in the listener. 'Dog Years' makes me want to look out on the horizon and contemplate life. And then when that chorus hits, my heart starts racing and I just shake my head in amazement.",
       "_id": 32,
       "photoCredit": "Maggie Rogers"
     },
     {
       "artist": "The xx",
       "title": "Say Something Loving",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513372292/dbrad2017/small/best_songs_2017_the_xx_2.png",
       "songURL": "https://www.youtube.com/watch?v=Rh2uNrIgGf4",
       "description": "The xx's third album, <i>I See You</i>, has proven to be a sure-footed leap forward for the British trio. I was a fan of the group's extra-minimalist approach on their first two albums (see <a target='_blank' href='https://www.youtube.com/watch?v=Pib8eYDSFEI'>'Crystalised'</a> for instance), but I love the expansion of their sound. 'Say Something Loving' is captivating ' the chemistry between singers Oliver Sim and Romy Madley Croft is as palpable as ever as they sing about fleeting feelings of love battling with their hesitations and insecurities, and Jamie xx's production pushes his bandmates to new heights.",
       "_id": 31,
       "photoCredit": "Alasdair McLellan"
     },
     {
       "artist": "Future",
       "title": "Mask Off",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_face:center,h_272,w_272/v1513669369/dbrad2017/small/best_songs_2017_future_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=aWb8z-KhZdo",
       "description": "2017 was the year of the flute in rap, and it all started with 'Mask Off' (see also Drake's <a target='_blank' href='https://open.spotify.com/track/0yYwtyNFxuIAHInOca7ASR'>'Portland'</a> and Kodak Black's <a target='_blank' href='https://www.youtube.com/watch?v=k4glokK_bhs'>'Tunnel Vision'</a> for other examples of flute-rap). 'Mask Off' was a mini-phenomenon, inspiring endless <a target='_blank' href='https://www.youtube.com/watch?v=jqcWnG2y3Kw'>memes</a> and <a target='_blank' href='https://www.youtube.com/watch?v=wKilws_KiSo#t=1m22s'>tributes</a>. Future's personality shines through, but it's the singular beat that makes 'Mask Off.' It's light and airy, unique in a medieval kind of way, and immediately pleasing to the ear. Just putting this out there: I need to hear a mash-up of this with a <a target='_blank' href='https://www.youtube.com/watch?v=M7jLiXeFm_E'>Jethro Tull song</a>. Somebody get on that, please.",
       "_id": 30,
       "photoCredit": "Michael Schwartz/Haute Living"
     },
     {
       "artist": "NE-HI ft. Jamila Woods",
       "title": "The Times I'm Not There",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_scale,w_272/v1513327277/dbrad2017/small/best_songs_2017_jamila_woods.jpg",
       "songURL": "https://www.youtube.com/watch?v=6wz4ZWhLveY",
       "description": "You would not immediately expect a white psych/garage rock band and a black soul singer to collaborate, but NE-HI and Jamila Woods, both hailing from Chicago, make magic together. NE-HI have flown under the radar, but released a very strong album this year (<a target='_blank' href='https://www.youtube.com/watch?v=ukGoMog-RYk'>'Stay Happy'</a> is a great, youthful anthem). Similarly, Jamila Woods has owned the indie R&B scene with her album <a target='_blank' href='https://soundcloud.com/jamilawoods/sets/heavn-3'><i>HEAVN</i></a> and her <a target='_blank' href='https://www.youtube.com/watch?v=KeqmbhyoFZQ'>frequent collaborations</a> with Chance the Rapper. On 'The Times I'm Not There,' NE-HI provide a soulful, jangly backdrop for Woods's intimate, welcoming vocals. And as a plus, all proceeds from the song are going directly to Chance the Rapper's youth-focused charity, SoulWorks.",
       "_id": 29,
       "photoCredit": "Zoe Rain"
     },
     {
       "artist": "Queens of the Stone Age",
       "title": "The Evil Has Landed",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513669379/dbrad2017/small/best_songs_2017_queens_stone_age_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=Exa0CzlCb3Y",
       "description": "Queens of the Stone Age have carried the torch for populist hard rock since <a target='_blank' href='https://dbradmusic.com/2017/08/24/an-analysis-of-my-first-ever-mix-cd-from-2002/'>I started first making mix CDs over 15 years ago</a>. 'The Evil Has Landed' is like an even funkier version of <a target='_blank' href='https://www.youtube.com/watch?v=H8bVaTW6UCU'>Led Zeppelin's 'The Ocean'</a>, a.k.a. the <a target='_blank' href='https://dbradmusic.com/2016/03/16/ranking-led-zeppelin/'>fifth greatest Zeppelin song ever</a>. The bouncy Bonham-esque drumbeat on the 'The Evil Has Landed,' combined with the fun guitar riff, fills me with unadulterated joy.",
       "_id": 28,
       "photoCredit": "Andrew Whitton/NME"
     },
     {
       "artist": "Drake",
       "title": "Passionfruit",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,g_west,h_272,w_272/v1513327079/dbrad2017/small/best_songs_2017_drake.jpg",
       "songURL": "https://soundcloud.com/octobersveryown/drake-passionfruit",
       "description": "<p>In March, Drake released what he calls a 'playlist project' entitled <i>More Life</i>, which is pretty much the same thing as an album but without the lofty expectations that accompany albums. It's basically a cop out, a shield against criticism. If it isn't received well, it doesn't matter because it's not <i>technically</i> an album. This characterization is working, because reviewers called <i>More Life</i> the best project Drake has done in years. That's an exaggeration - the 'playlist' certainly boasts some great highlights, but they're surrounded by a glut of mid-tempo filler.</p><p>'Passionfruit' is the highest of those highlights. It will never cease to amaze me how Drake, when he's on his game, can be so good at rap and also so good at pop/R&B. He's the <a target='_blank' href='https://en.wikipedia.org/wiki/Bo_Jackson'>Bo Jackson</a> of music, <a target='_blank' href='https://www.urbandictionary.com/define.php?term=dont+%40+me'>don't @ me</a>. 'Passionfruit' has Drake bringing his R&B A-game on a song that is aptly titled - imagine what a tropical Starburst would sound like. Got it? Yep, that's 'Passionfruit.' It's like <a target='_blank' href='https://en.wikipedia.org/wiki/Chillwave'>chillwave</a> with a vaguely Caribbean bent to it. Long live chillwave Drake.</p>",
       "_id": 27,
       "photoCredit": "Caitlin Cronenberg"
     },
     {
       "artist": "Japanese Breakfast",
       "title": "Road Head",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_scale,w_272/v1513327170/dbrad2017/small/best_songs_2017_japanese_breakfast.jpg",
       "songURL": "https://www.youtube.com/watch?v=cCmLjb-ocPY",
       "description": "Michelle Zauner, the brains behind Japanese Breakfast, is unparalleled in her ability to create a thick atmosphere of sound and feeling. 'Road Head' is mystical and engaging; Zauner's voice, dreamy and captivating. To feel the full effect, headphones or good speakers are required.",
       "_id": 26,
       "photoCredit": "Ebru Yildiz/Dead Oceans"
     },
     {
       "artist": "Sheer Mag",
       "title": "Need to Feel Your Love",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513327541/dbrad2017/small/best_songs_2017_sheer_mag.jpg",
       "songURL": "https://www.youtube.com/watch?v=jdJPMYQt9Tk",
       "description": "Sheer Mag introduced themselves to the world with a trio of rip-roaring, female-led, DIY, good-time punk rock (including <a target='_blank' href='https://www.youtube.com/watch?v=I19Qh727-Tc'>'Can't Stop Fighting'</a>, which made it into my <a target='_blank' href='https://dbradmusic.com/2016/12/29/best-songs-of-2016/'>top 20 songs</a> last year. On 'Need to Feel Your Love,' they keep those fiery elements of their EPs, but infuse their sound with an undoubtable 'classic rock' feel. 'Need to Feel Your Love' boogies with the best of them, with a groove that's guaranteed to immediately improve your mood.",
       "_id": 25,
       "photoCredit": "Marie Lin"
     },
     {
       "artist": "Hurray for the Riff Raff",
       "title": "Living in the City",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_scale,h_272,w_272/v1513327628/dbrad2017/small/best_songs_2017_hurray_riff_raff_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=Q8k6msNLoQw",
       "description": "Alynda Segarra, who records under the name Hurray for the Riff Raff, is exceptionally talented. She has mastered many genres of music, including Americana, folk, Latin, and rock, and they mesh well into Segarra's unique style. 'Living in the City' was one of my favorite songs this summer -- you can feel the heat radiating off of it. It almost sounds like a faster, harder Dusty Springfield song, with an undoubtable late '60s flavor. Oh and also, Segarra's voice is very cool.",
       "_id": 24,
       "photoCredit": "Hurray for the Riff Raff/ATO Records"
     },
     {
       "artist": "Rolling Blackouts Coastal Fever",
       "title": "French Press",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513669863/dbrad2017/small/best_songs_2017_rolling_blackouts_cf_2.jpg",
       "songURL": "https://www.youtube.com/watch?v=bvjsAIpNy6I",
       "description": "Rolling Blackouts Coastal Fever, a five-piece band from Melbourne, make indie rock that breathes and seethes. Some of Rolling Blackouts Coastal Fever's peers have a tendency to make pleasant, enjoyable but ultimately shallow beach-rock, but these guys have something special, something hard to describe. The jangly guitar interplay on 'French Press' would definitely sound great on a beach in the summer, but it also has dark undercurrents and deep crevices. It stays with you.",
       "_id": 23,
       "photoCredit": "McLean Stephenson/Sub Pop"
     },
     {
       "artist": "The Horrors",
       "title": "Something to Remember Me By",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_fill,h_272,w_272/v1513669416/dbrad2017/small/best_songs_2017_the_horrors_4.jpg",
       "songURL": "https://www.youtube.com/watch?v=cbOMvegSPpc",
       "description": "There's a lot of mediocre synth rock out there. If you're a fan of 'Safe and Sound' by Capital Cities, this is where I tell you that there is something better for you. 'Something to Remember Me By' is the good stuff. The Horrors, hailing from southeast England, imbue 'Something to Remember Me By' with thick layers of synthesizers, but leave well enough air for the catchy melody to sink in. The groove stays constant throughout, acting as an anchor for the epic increases and decreases in dynamics.",
       "_id": 22,
       "photoCredit": "Tom Beard"
     },
     {
       "artist": "The War on Drugs",
       "title": "Thinking of a Place",
       "imgURL": "http://res.cloudinary.com/ddvn6aemk/image/upload/c_scale,w_272/v1513327330/dbrad2017/small/best_songs_2017_war_on_drugs_3.jpg",
       "songURL": "https://www.youtube.com/watch?v=TeaDE1magRk",
       "description": "Adam Granduciel, the man who writes and records every note of the War on Drugs' music, is a perfectionist, to our great benefit. The details he puts in his satisfying brew of rock and roll are delightful. About five minutes into 'Thinking of a Place,' the bass and drums drop out and you expect the song to close out, but then they come booming back in, and it's actually a huge relief. It is <i>astonishingly</i> rare for me to want a song to continue six minutes in, but I would feel cheated if 'Thinking of a Place' ended there. I've written many times about songs that hit the spot during an evening or night drive, but I think we've found the #1 contender for 'best night drive' song. Oh, and spoiler alert: this will not be the last time you see the War on Drugs on this list.",
       "_id": 21,
       "photoCredit": "The War on Drugs/Atlantic"
     }
	]
}